# GetPoint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..GetPoint Method
PolymeshTopology Class See Also
---
Returns one point at the given index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ GetPoint(
	int idx
)
```

Visual Basic
---
```text
Public Function GetPoint ( _
	idx As Integer _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetPoint(
	int idx
)
```

# ### Parameters
idx
    Type: System..::..Int32 A zero-based index of a polymesh point
# ### Return Value
XYZ coordinates of the point
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value is not a valid index of a point of the polymesh. A valid valure is not negative and is smaller than the number of points in the polymesh. |

# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace